[
    {
        "casting_time": "1 minute",
        "classes": [
            "wizard"
        ],
        "components": {
            "material": true,
            "materials_needed": [
                "Powdered rhubarb leaf and an adder's stomach"
            ],
            "raw": "V, S, M (Powdered rhubarb leaf and an adder's stomach)",
            "somatic": true,
            "verbal": true
        },
        "description": "A shimmering green arrow streaks toward a target within range and bursts in a spray of acid. Make a ranged spell Attack against the target. On a hit, the target takes 4d4 acid damage immediately and 2d4 acid damage at the end of its next turn. On a miss, the arrow splashes the target with acid for half as much of the initial damage and no damage at the end of its next turn.",
        "duration": "Instantaneous",
        "higher_levels": "When you cast this spell using a spell slot of 3rd Level or higher, the damage (both initial and later) increases by 1d4 for each slot level above 2nd.",
        "level": "2",
        "name": "Acid Arrow",
        "range": "Self (10-foot-radius hemisphere)",
        "ritual": false,
        "school": "evocation",
        "tags": [
            "wizard",
            "level2"
        ],
        "type": "2th-level evocation"
    },
    {
        "casting_time": "1 action",
        "classes": [
            "sorcerer",
            "warlock",
            "wizard"
        ],
        "components": {
            "material": false,
            "raw": "V, S",
            "somatic": true,
            "verbal": true
        },
        "description": "You create linked teleportation portals that remain open for the duration. Choose two points on the ground that you can see, one point within 10 feet of you and one point within 500 feet of you. A circular portal, 10 feet in diameter, opens over each point. If the portal would open in the space occupied by a creature, the spell fails, and the casting is lost.\n\nThe portals are two-dimensional glowing rings filled with mist, hovering inches from the ground and perpendicular to it at the points you choose. A ring is visible only from one side (your choice), which is the side that functions as a portal.\n\nAny creature or object entering the portal exits from the other portal as if the two were adjacent to each other; passing through a portal from the nonportal side has no effect. The mist that fills each portal is opaque and blocks vision through it. On your turn, you can rotate the rings as a bonus action so that the active side faces in a different direction.",
        "duration": "Concentration, up to 10 minutes",
        "level": "6",
        "name": "Arcane Gate",
        "range": "500 feet",
        "ritual": false,
        "school": "conjuration",
        "tags": [
            "sorcerer",
            "warlock",
            "wizard",
            "level6"
        ],
        "type": "6th-level conjuration"
    },
    {
        "casting_time": "1 action",
        "classes": [
            "cleric",
            "paladin"
        ],
        "components": {
            "material": true,
            "materials_needed": [
                "a tiny strip of white cloth"
            ],
            "raw": "V, S, M (a tiny strip of white cloth)",
            "somatic": true,
            "verbal": true
        },
        "description": "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target’s hit point maximum and current hit points increase by 5 for the duration.",
        "duration": "8 hours",
        "higher_levels": "When you cast this spell using a spell slot of 3rd level or higher, a target’s hit points increase by an additional 5 for each slot level above 2nd.",
        "level": "2",
        "name": "Aid",
        "range": "30 feet",
        "ritual": false,
        "school": "abjuration",
        "tags": [
            "cleric",
            "paladin",
            "level2"
        ],
        "type": "2nd-level abjuration"
    },
    {
        "casting_time": "1 bonus action",
        "classes": [
            "paladin",
            "wizard"
        ],
        "components": {
            "material": false,
            "raw": "V, S",
            "somatic": true,
            "verbal": true
        },
        "description": "You touch a nonmagical weapon. Until the spell ends, that weapon becomes a magic weapon with a +1 bonus to attack rolls and damage rolls.",
        "duration": "Concentration, up to 1 hour",
        "higher_levels": "When you cast this spell using a spell slot of 4th level or higher, the bonus increases to +2. When you use a spell slot of 6th level or higher, the bonus increases to +3.",
        "level": "2",
        "name": "Magic Weapon",
        "range": "Touch",
        "ritual": false,
        "school": "transmutation",
        "tags": [
            "paladin",
            "wizard",
            "level2"
        ],
        "type": "2nd-level transmutation"
    },
    {
        "casting_time": "1 action",
        "classes": [
            "druid",
            "sorcerer",
            "wizard"
        ],
        "components": {
            "material": true,
            "materials_needed": [
                "a small piece of phosphorus"
            ],
            "raw": "V, S, M (a small piece of phosphorus)",
            "somatic": true,
            "verbal": true
        },
        "description": "You create a wall of fire on a solid surface within range. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is opaque and lasts for the duration.\n\nWhen the wall appears, each creature within its area must make a Dexterity saving throw. On a failed save, a creature takes 5d8 fire damage, or half as much damage on a successful save.\n\nOne side of the wall, selected by you when you cast this spell, deals 5d8 fire damage to each creature that ends its turn within 10 feet of that side or inside the wall. A creature takes the same damage when it enters the wall for the first time on a turn or ends its turn there. The other side of the wall deals no damage.",
        "duration": "Concentration, up to 1 minute",
        "higher_levels": "When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d8 for each slot level above 4th.",
        "level": "4",
        "name": "Wall of Fire",
        "range": "120 feet",
        "ritual": false,
        "school": "evocation",
        "tags": [
            "druid",
            "sorcerer",
            "wizard",
            "level4"
        ],
        "type": "4th-level evocation"
    }
]